## homotopy.jl --- 

###_____________________________________________________________________________
##
##  Load Packages
###_____________________________________________________________________________

import Pkg
Pkg.add("HomotopyContinuation")
Pkg.add("DelimitedFiles")
using HomotopyContinuation, LinearAlgebra, DelimitedFiles

# This script was tested with Julia v1.5.3.

###_____________________________________________________________________________
## 
##  Define variables and some constraints
###_____________________________________________________________________________

@var θ[1:5] f₋₋₋₋ f₋₋₋₊ f₋₋₊₋ f₋₋₊₊ f₋₊₋₋ f₋₊₋₊ f₋₊₊₋ f₋₊₊₊ f₊₋₋₋ f₊₋₋₊ f₊₋₊₋ f₊₋₊₊ f₊₊₋₋ f₊₊₋₊ f₊₊₊₋ f₊₊₊₊

f₋₋₋₋ =
f₋₋₋₊ =
f₋₋₊₋ =
f₋₋₊₊ =
f₋₊₋₋ =
f₋₊₋₊ =
f₋₊₊₋ =
f₋₊₊₊ =
f₊₋₋₋ = (1/16) * (1 - θ₁θ₅θ₂ - θ₁θ₃ - θ₁θ₅θ₄ + θ₂θ₅θ₃ + θ₂θ₄ + θ₃θ₅θ₄ - θ₁θ₃θ₂θ₄)
f₊₋₋₊ = (1/16) * (1 - θ₁θ₅θ₂ - θ₁θ₃ + θ₁θ₅θ₄ + θ₂θ₅θ₃ - θ₂θ₄ - θ₃θ₅θ₄ + θ₁θ₃θ₂θ₄)
f₊₋₊₋ = (1/16) * (1 - θ₁θ₅θ₂ + θ₁θ₃ - θ₁θ₅θ₄ - θ₂θ₅θ₃ + θ₂θ₄ - θ₃θ₅θ₄ + θ₁θ₃θ₂θ₄)
f₊₋₊₊ = (1/16) * (1 - θ₁θ₅θ₂ + θ₁θ₃ + θ₁θ₅θ₄ - θ₂θ₅θ₃ - θ₂θ₄ + θ₃θ₅θ₄ - θ₁θ₃θ₂θ₄)
f₊₊₋₋ = (1/16) * (1 + θ₁θ₅θ₂ - θ₁θ₃ - θ₁θ₅θ₄ - θ₂θ₅θ₃ - θ₂θ₄ + θ₃θ₅θ₄ + θ₁θ₃θ₂θ₄)
f₊₊₋₊ = (1/16) * (1 + θ₁θ₅θ₂ - θ₁θ₃ + θ₁θ₅θ₄ - θ₂θ₅θ₃ + θ₂θ₄ - θ₃θ₅θ₄ - θ₁θ₃θ₂θ₄)
f₊₊₊₋ = (1/16) * (1 + θ₁θ₅θ₂ + θ₁θ₃ - θ₁θ₅θ₄ + θ₂θ₅θ₃ - θ₂θ₄ - θ₃θ₅θ₄ - θ₁θ₃θ₂θ₄)
f₊₊₊₊ = (1/16) * (1 + θ₁θ₅θ₂ + θ₁θ₃ + θ₁θ₅θ₄ + θ₂θ₅θ₃ + θ₂θ₄ + θ₃θ₅θ₄ + θ₁θ₃θ₂θ₄)


###_____________________________________________________________________________
##
## Define the critical equations + constraints
###_____________________________________________________________________________

